{
    "books": [
      {
        "isbn": "1234567890",
        "title": "The Haunting of Hill House",
        "author": "Shirley Jackson",
        "price": "$12.99",
        "description": "A chilling tale of a haunted mansion that has stood for 80 years, featuring four people who come to stay there and experience its sinister power.",
        "rating": 4.5
      },
      {
        "isbn": "2345678901",
        "title": "It",
        "author": "Stephen King",
        "price": "$14.95",
        "description": "Pennywise the Dancing Clown terrorizes the small town of Derry, Maine, in this masterful horror novel by Stephen King.",
        "rating": 4.8
      },
      {
        "isbn": "3456789012",
        "title": "Dracula",
        "author": "Bram Stoker",
        "price": "$9.99",
        "description": "Bram Stoker's iconic novel about Count Dracula, a vampire who threatens the safety of London, is a classic horror story that has stood the test of time.",
        "rating": 4.7
      },
      {
        "isbn": "4567890123",
        "title": "Psycho",
        "author": "Robert Bloch",
        "price": "$11.99",
        "description": "Robert Bloch's psychological thriller about the unsettling events at the Bates Motel and the mysterious Norman Bates is a true horror classic.",
        "rating": 4.4
      },
      {
        "isbn": "5678901234",
        "title": "Bird Box",
        "author": "Josh Malerman",
        "price": "$10.50",
        "description": "Josh Malerman's post-apocalyptic horror novel tells the story of a mother and her two children, blindfolded and trying to survive in a world filled with supernatural creatures that drive people to madness.",
        "rating": 4.6
      },
      {
        "isbn": "6789012345",
        "title": "The Shining",
        "author": "Stephen King",
        "price": "$13.75",
        "description": "Stephen King's classic story of the Torrance family's descent into madness while serving as caretakers for the haunted Overlook Hotel is a must-read for horror fans.",
        "rating": 4.7
      },
      {
        "isbn": "7890123456",
        "title": "The Exorcist",
        "author": "William Peter Blatty",
        "price": "$12.99",
        "description": "William Peter Blatty's tale of the demonic possession of a young girl and the desperate exorcism attempts to save her soul is a terrifying and unforgettable horror story.",
        "rating": 4.6
      },
      {
        "isbn": "8901234567",
        "title": "Hell House",
        "author": "Richard Matheson",
        "price": "$9.95",
        "description": "Richard Matheson's novel follows a team of researchers who enter the notorious Belasco House, known as the Mount Everest of haunted houses, to uncover its dark secrets.",
        "rating": 4.4
      },
      {
        "isbn": "9012345678",
        "title": "The Silence of the Lambs",
        "author": "Thomas Harris",
        "price": "$14.50",
        "description": "Thomas Harris's thriller introduces the brilliant but insane Dr. Hannibal Lecter and FBI trainee Clarice Starling, who must consult him to catch a serial killer known as Buffalo Bill.",
        "rating": 4.7
      },
      {
        "isbn": "0123456789",
        "title": "The Girl with All the Gifts",
        "author": "M.R. Carey",
        "price": "$11.75",
        "description": "M.R. Carey's post-apocalyptic thriller follows a group of survivors, including a young girl with a mysterious gift, as they navigate a world overrun by fungal zombies.",
        "rating": 4.6
      },
      {
        "isbn": "1234567890",
        "title": "American Psycho",
        "author": "Bret Easton Ellis",
        "price": "$12.99",
        "description": "Bret Easton Ellis's novel follows the life of Patrick Bateman, a wealthy investment banker who also happens to be a psychopathic serial killer.",
        "rating": 4.5
      },
      {
        "isbn": "2345678901",
        "title": "The Ruins",
        "author": "Scott Smith",
        "price": "$10.99",
        "description": "Scott Smith's horror novel tells the story of a group of American tourists who venture into the Mexican jungle and discover an ancient, malevolent force that lurks within the ruins.",
        "rating": 4.4
      },
      {
        "isbn": "3456789012",
        "title": "House of Leaves",
        "author": "Mark Z. Danielewski",
        "price": "$16.75",
        "description": "Mark Z. Danielewski's innovative and mind-bending novel explores a family's experience in a labyrinthine, ever-changing house that defies the laws of physics and reality.",
        "rating": 4.7
      },
      {
        "isbn": "4567890123",
        "title": "The Babadook",
        "author": "Jennifer Kent",
        "price": "$11.25",
        "description": "Based on the cult-classic horror film, this novelization by Jennifer Kent tells the story of a mother and son tormented by a sinister children's book character that comes to life.",
        "rating": 4.5
      },
      {
        "isbn": "5678901234",
        "title": "The Terror",
        "author": "Dan Simmons",
        "price": "$14.99",
        "description": "Dan Simmons's historical horror novel is a fictional account of the doomed Franklin Expedition's attempt to find the Northwest Passage, with a supernatural twist involving a monstrous creature stalking the crew.",
        "rating": 4.7
      },
      {
        "isbn": "6789012345",
        "title": "The Troop",
        "author": "Nick Cutter",
        "price": "$10.99",
        "description": "Nick Cutter's horror novel follows a group of Boy Scouts on a remote island camping trip, where they encounter a deadly contagion that turns them into monsters.",
        "rating": 4.6
      },
      {
        "isbn": "7890123456",
        "title": "Mexican Gothic",
        "author": "Silvia Moreno-Garcia",
        "price": "$12.50",
        "description": "Silvia Moreno-Garcia's novel is a gothic horror tale set in 1950s Mexico, where a socialite travels to a haunted mansion to rescue her cousin from a terrifying fate.",
        "rating": 4.6
      },
      {
        "isbn": "9012345678",
        "title": "Annihilation",
        "author": "Jeff VanderMeer",
        "price": "$11.75",
        "description": "Jeff VanderMeer's novel is the first in the Southern Reach Trilogy, where a team of female scientists ventures into a mysterious and deadly environmental zone known as Area X.",
        "rating": 4.7
      },
      {
        "isbn": "0123456789",
        "title": "The Witching Hour",
        "author": "Anne Rice",
        "price": "$13.99",
        "description": "Anne Rice's novel delves into the Mayfair Witches, a powerful and haunted family, and their connection to the supernatural, weaving a tale of dark secrets and ancient magic.",
        "rating": 4.6
      },
      {
        "isbn": "1234567890",
        "title": "Heart-Shaped Box",
        "author": "Joe Hill",
        "price": "$11.95",
        "description": "Joe Hill's chilling novel follows a retired rock star who purchases a haunted suit online, setting off a terrifying chain of supernatural events that threaten his life and sanity.",
        "rating": 4.7
      },
      {
        "isbn": "2345678901",
        "title": "Pet Sematary",
        "author": "Stephen King",
        "price": "$12.99",
        "description": "Stephen King's novel explores the darkness of grief and the horrifying consequences of bringing the dead back to life in a cursed burial ground.",
        "rating": 4.8
      },
      {
        "isbn": "3456789012",
        "title": "The Woman in Black",
        "author": "Susan Hill",
        "price": "$10.50",
        "description": "Susan Hill's ghost story takes place in a remote English village, where a malevolent spirit haunts Eel Marsh House, terrorizing the locals and a young lawyer sent to settle the estate.",
        "rating": 4.5
      },
      {
        "isbn": "4567890123",
        "title": "The Hellbound Heart",
        "author": "Clive Barker",
        "price": "$11.99",
        "description": "Clive Barker's novella introduces readers to the sadomasochistic Cenobites, led by the iconic Pinhead, who are summoned by a mysterious puzzle box, bringing pain and pleasure to those who open it.",
        "rating": 4.6
      },
      {
        "isbn": "5678901234",
        "title": "The Passage",
        "author": "Justin Cronin",
        "price": "$14.75",
        "description": "Justin Cronin's post-apocalyptic novel explores a world overrun by vampiric creatures created by a government experiment gone awry, and the survivors who must navigate this new and deadly landscape.",
        "rating": 4.7
      },
      {
        "isbn": "6789012345",
        "title": "The Elementals",
        "author": "Michael McDowell",
        "price": "$12.50",
        "description": "Michael McDowell's novel follows a Southern family with a dark and haunted history as they confront supernatural forces on a remote Alabama beach.",
        "rating": 4.5
      },
      {
        "isbn": "7890123456",
        "title": "Annabelle",
        "author": "Ruby Jean Jensen",
        "price": "$9.99",
        "description": "Ruby Jean Jensen's horror novel revolves around a cursed doll named Annabelle and the terror it brings to a family when it is discovered in an old house.",
        "rating": 4.3
      },
      {
        "isbn": "9012345678",
        "title": "The Haunting of Ashburn House",
        "author": "Darcy Coates",
        "price": "$11.75",
        "description": "Darcy Coates's novel follows a woman who inherits a mysterious old mansion, only to discover that it holds dark secrets and supernatural entities that threaten her sanity.",
        "rating": 4.4
      },
      {
        "isbn": "0123456789",
        "title": "The Girl Next Door",
        "author": "Jack Ketchum",
        "price": "$10.99",
        "description": "Jack Ketchum's novel is based on a true story and delves into the horrifying abuse and torment inflicted upon a young girl by her caretakers and the neighbors who turn a blind eye.",
        "rating": 4.6
      },
      {
        "isbn": "1234567890",
        "title": "The Fisherman",
        "author": "John Langan",
        "price": "$13.50",
        "description": "John Langan's novel follows a grieving widower who takes up fishing as a way to cope with his loss but stumbles upon a dark and ancient secret in the waters of upstate New York.",
        "rating": 4.7
      },
      {
        "isbn": "2345678901",
        "title": "The Little Friend",
        "author": "Donna Tartt",
        "price": "$14.99",
        "description": "Donna Tartt's dark and suspenseful novel explores the mystery of a young girl's murder in a small Southern town and the family secrets that shroud the truth.",
        "rating": 4.7
      },
      {
        "isbn": "3456789012",
        "title": "The Chalk Man",
        "author": "C.J. Tudor",
        "price": "$10.99",
        "description": "C.J. Tudor's novel is a gripping and atmospheric tale of a group of childhood friends who are haunted by a series of chalk drawings that lead to dark secrets and a terrifying revelation.",
        "rating": 4.5
      },
      {
        "isbn": "4567890123",
        "title": "Imajica",
        "author": "Clive Barker",
        "price": "$15.75",
        "description": "Clive Barker's epic fantasy horror novel explores the existence of parallel worlds, mystical realms, and powerful beings as it takes readers on a journey through the Imajica.",
        "rating": 4.7
      },
      {
        "isbn": "5678901234",
        "title": "The Ritual",
        "author": "Adam Nevill",
        "price": "$12.50",
        "description": "Adam Nevill's novel follows a group of friends on a hiking trip in the Scandinavian wilderness, where they encounter a malevolent force that threatens to consume them.",
        "rating": 4.6
      },
      {
        "isbn": "6789012345",
        "title": "The Silent Patient",
        "author": "Alex Michaelides",
        "price": "$14.99",
        "description": "Alex Michaelides's psychological thriller tells the story of a famous artist who murders her husband and then becomes mute, leading to her commitment to a secure psychiatric facility. A psychotherapist becomes obsessed with uncovering the truth behind her silence.",
        "rating": 4.8
      },
      {
        "isbn": "7890123456",
        "title": "The Deep",
        "author": "Nick Cutter",
        "price": "$11.25",
        "description": "Nick Cutter's horror novel follows a veterinarian who is sent to a research station at the bottom of the ocean to investigate a mysterious and deadly disease that affects the crew, leading to a descent into madness and terror.",
        "rating": 4.6
      },
      {
        "isbn": "9012345678",
        "title": "The Secret of Crickley Hall",
        "author": "James Herbert",
        "price": "$10.99",
        "description": "James Herbert's novel follows a grieving family who moves to Crickley Hall, a haunted and ancient mansion, where they begin to experience supernatural phenomena and uncover the dark secrets of the house.",
        "rating": 4.5
      },
      {
        "isbn": "0123456789",
        "title": "The Cabin at the End of the World",
        "author": "Paul Tremblay",
        "price": "$12.50",
        "description": "Paul Tremblay's novel tells the story of a vacationing family who are terrorized by a group of strangers claiming the world is on the brink of apocalypse, and they must make a horrifying choice to save it.",
        "rating": 4.6
      },
      {
        "isbn": "2345678901",
        "title": "The Whisper Man",
        "author": "Alex North",
        "price": "$11.75",
        "description": "Alex North's thriller follows a father and son who move to a small town with a dark history, where a serial killer once preyed on young children. Now, a new series of abductions begins, and the past returns to haunt them.",
        "rating": 4.7
      },
      {
        "isbn": "3456789012",
        "title": "The Family Plot",
        "author": "Cherie Priest",
        "price": "$10.99",
        "description": "Cherie Priest's novel follows a salvage crew hired to strip an old estate of its valuables. They soon discover that the house is haunted, and the malevolent spirits have other plans for them.",
        "rating": 4.5
      }
    ]
  }
  